TMM_src/Catalogs/АнкетыИОпросы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>АнкетыИОпросы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Партнёр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнёры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Мероприятие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыАнкетаОпрос</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Вопросы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Вопрос</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантОтвета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

TMM_src/Catalogs/АнкетыИОпросы/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ВопросыВопросНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекДанные = Элементы.Вопросы.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МассивОтветов = Новый Массив;
	Для каждого Стр Из Объект.Вопросы Цикл
		Если НЕ ПустаяСтрока(Стр.Вопрос) и  МассивОтветов.Найти(Стр.Вопрос) = Неопределено Тогда
			МассивОтветов.Добавить(Стр.Вопрос);
		КонецЕсли;
	КонецЦикла;
	
	Если МассивОтветов.Количество() Тогда
	
	СписокОтветов = Новый СписокЗначений;
	СписокОтветов.ЗагрузитьЗначения(МассивОтветов);
	
	ОбработкаВыбораВМеню = Новый ОписаниеОповещения("ОкончаниеВыбораВопросаИзМеню", ЭтаФорма, Новый Структура("ТекДанные",ТекДанные));
	//ПоказатьВыборИзМеню(ОбработкаВыбораВМеню,СписокОтветов,Элемент);
	ПоказатьВыборИзСписка(ОбработкаВыбораВМеню,СписокОтветов,Элемент);
	
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ОкончаниеВыбораВопросаИзМеню(ВыбранныйВопрос,ДопПараметры) Экспорт
	
	ДопПараметры.ТекДанные.Вопрос = ВыбранныйВопрос;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросыВариантОтветаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	 ТекДанные = Элементы.Вопросы.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МассивОтветов = Новый Массив;
	Для каждого Стр Из Объект.Вопросы Цикл
		Если НЕ ПустаяСтрока(Стр.ВариантОтвета) и  МассивОтветов.Найти(Стр.ВариантОтвета) = Неопределено Тогда
			МассивОтветов.Добавить(Стр.ВариантОтвета);
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ МассивОтветов.Количество() Тогда
		
		МассивДополнительныеОтветы = СтрРазделить("Да,Нет,Не знаю",",");
		Для каждого Ответ Из  МассивДополнительныеОтветы Цикл
			
			 Если МассивОтветов.Найти(Ответ) = Неопределено Тогда
				МассивОтветов.Добавить(Ответ);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	СписокОтветов = Новый СписокЗначений;
	СписокОтветов.ЗагрузитьЗначения(МассивОтветов);
	
	ОбработкаВыбораВМеню = Новый ОписаниеОповещения("ОкончаниеВыбораОтветаИзМеню", ЭтаФорма, Новый Структура("ТекДанные",ТекДанные));
	//ПоказатьВыборИзМеню(ОбработкаВыбораВМеню,СписокОтветов,Элемент);
	ПоказатьВыборИзСписка(ОбработкаВыбораВМеню,СписокОтветов,Элемент);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОкончаниеВыбораОтветаИзМеню(ВыбранныйОтвет,ДопПараметры) Экспорт
	
	ДопПараметры.ТекДанные.ВариантОтвета = ВыбранныйОтвет;
	
КонецПроцедуры
